Documents/упЗадачаНаОтправкуФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упЗадачаНаОтправкуФайлов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упЗадачиОтправкиФайловМобильныйКлиент</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапросаНаОтправкуФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыЗапросовНаОтправкуФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСозданияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упИсточникиСозданияОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыЗадачНаОтправкуФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трекер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМобильныеУстройстваИТрекеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеМониторинга</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упСобытиеМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упЗадачиОтправкиФайловМобильныйКлиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упЗадачиОтправкиФайловМобильныйКлиент</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыЗадачНаОтправкуФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапросаНаОтправкуФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыЗапросовНаОтправкуФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Трекер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМобильныеУстройстваИТрекеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упУведомленияМобильныйКлиент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упУведомленияМобильныйКлиент</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Трекер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМобильныеУстройстваИТрекеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упСтатусыЗадачНаОтправкуФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыЗадачНаОтправкуФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФайлПодготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФайлОтправлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упВидыЗапросовНаОтправкуФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыЗапросовНаОтправкуФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтчетПоЗадолженностямВодителя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упЗадачаНаОтправкуФайлов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Файл) И (Статус = Перечисления.упСтатусыЗадачНаОтправкуФайлов.ФайлПодготовлен Или Статус = Перечисления.упСтатусыЗадачНаОтправкуФайлов.ФайлОтправлен) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Для перевода задачи в статус ""%1"" необходимо указать файл.'"), Статус);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ВидЗапросаНаОтправкуФайлов) Тогда
		ВидЗапросаНаОтправкуФайлов = Перечисления.упВидыЗапросовНаОтправкуФайлов.ОтчетПоЗадолженностямВодителя;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Файл) И Статус = Перечисления.упСтатусыЗадачНаОтправкуФайлов.Новая Тогда
		Статус = Перечисления.упСтатусыЗадачНаОтправкуФайлов.ФайлПодготовлен;
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = Строка(Новый УникальныйИдентификатор());
	КонецЕсли; 
	
	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта();	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ФайлПодготовлен = (Статус = Перечисления.упСтатусыЗадачНаОтправкуФайлов.ФайлПодготовлен);
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упЗадачиОтправкиФайловМобильныйКлиент");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Трекер"       , Трекер);
	ЭлементБлокировки.УстановитьЗначение("Идентификатор", Идентификатор);
	
	Если ФайлПодготовлен Тогда
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упУведомленияМобильныйКлиент");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Трекер", Трекер);
		ЭлементБлокировки.УстановитьЗначение("Рейс", Документы.упРейс.ПустаяСсылка());
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторЗадачи", ИдентификаторЗадачи);
	КонецЕсли; 
	
	упСервисныеФункции.УстановитьУправляемуюБлокировку(БлокировкаДанных, Ссылка, Отказ);
	
	// регистр упЗадачиОтправкиФайловМобильныйКлиент
	Движения.упЗадачиОтправкиФайловМобильныйКлиент.Записывать = Истина;
	Движения.упЗадачиОтправкиФайловМобильныйКлиент.Очистить();
	
	Движение = Движения.упЗадачиОтправкиФайловМобильныйКлиент.Добавить();
	Движение.Регистратор                = Ссылка;
	Движение.Трекер                     = Трекер;
	Движение.Идентификатор              = Идентификатор;
	Движение.Статус                     = Статус;
	Движение.ИдентификаторЗадачи        = ИдентификаторЗадачи;
	Движение.Файл                       = Файл;
	Движение.ВидЗапросаНаОтправкуФайлов = ВидЗапросаНаОтправкуФайлов;
	
	Если ФайлПодготовлен Тогда
		ЗаголовокУведомления = НСтр("ru = 'Новые файлы'");
		ТипСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СобытиеМониторинга, "ТипСобытия");
		
		упУведомленияМобильныйКлиент = РегистрыСведений.упУведомленияМобильныйКлиент.СоздатьМенеджерЗаписи();
		упУведомленияМобильныйКлиент.Трекер              = Трекер;
		упУведомленияМобильныйКлиент.Рейс                = Документы.упРейс.ПустаяСсылка();
		упУведомленияМобильныйКлиент.ИдентификаторЗадачи = ИдентификаторЗадачи;
		упУведомленияМобильныйКлиент.Прочитать();
		
		Если ТипСобытия = Справочники.упТипыСобытийМониторинга.ЗапросОтчетаПоЗадолженностямВодителя Тогда
			ТекстУведомления = НСтр("ru = 'Отчет по задолженностям доступен для скачивания.'");	
		Иначе	
			ТекстУведомления = НСтр("ru = 'На сервере подготовлен новый файл для скачивания.'");	
		КонецЕсли; 
		
		упУведомленияМобильныйКлиент.Трекер              = Трекер;
		упУведомленияМобильныйКлиент.ИдентификаторЗадачи = ИдентификаторЗадачи;
		упУведомленияМобильныйКлиент.Отправлено = Ложь;
		упУведомленияМобильныйКлиент.Заголовок = ЗаголовокУведомления; 
		упУведомленияМобильныйКлиент.ТекстУведомления = ТекстУведомления;
		упУведомленияМобильныйКлиент.Записать();	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли
